#include<iostream>
using namespace std;
void main()

{
	setlocale(LC_ALL, "Russian");
	cout << "В лесу родилась ёлочка,\n";
	cout << "В лесу она росла,\n";
	cout << "Зимой и летом стройная,\n";
	cout << "Зеленая была.\n";
	cout << endl;
	cout << "Метель ей пела песенку:\n";
	cout << "\"Спи, елочка, бай-бай,\"\n";
	cout << "Мороз снежком укутывал:\n";
	cout << "Смотри, не замерзай!\n";
	cout << endl;
	cout << "Трусишка зайка серенький\n";
	cout << "Под ёлочкой скакал.\n";
	cout << "Порою волк, сердитый волк,\n";
	cout << "Рысцою пробегал.\n";
	cout << endl;
	cout << "Чу! Снег по лесу частому\n";
	cout << "Под полозом скрипит.\n";
	cout << "Лощадка мохноногая\n";
	cout << "Торопится, бежит.\n";
	cout << endl;
	cout << "Везет лошадка дровенки,\n";
	cout << "А в дровнях старичок,\n";
	cout << "Срубил он нашу елочку\n";
	cout << "Под самый корешок.\n";
	cout << endl;
	cout << "Теперь она, нарядная,\n";
	cout << "На праздник к нам пришла\n";
	cout << "И много, много радости\n";
	cout << "Детишкам принесла.";
	cout << "HAPPY)";
}